def find_day(M, Y): # ฟังก์ชั่นหลักไว้ดูวันของเดือนและปีว่ามีกี่วัน
    M_list = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31] # Listของวันในแต่ละเดือน(ค่าเริ่มต้นเดือนกุมภาให้เป็น28วัน)

    if find_feb(Y): # เรียกใช้ฟังก์ชั่นหาปีอธิกสุรทิน
        M_list[M-1] = 29 # ถ้าเป็นอธิกสุรทินก็เปลี่ยน 28วัน เป็น 29วัน
        return M_list[M-1], 366 # ส่งค่าวันของเดือนและปีออกไป
    else:
        return M_list[M-1], 356# ส่งค่าวันของเดือนและปีออกไป

def find_feb(Y): # ฟังก์ชั่นแยก สำหรับหาว่าปีที่ป้อนเป็นปีอธิกสุรทินไหม
    if Y%4 == 0 and Y%100 != 0 or Y%400 == 0: # เป็นอธิกสุรทินไหม
        return True
    else: # ถ้าเป็นปีปกติสุรทินก็จะเป็นเท็จ
        return False

M, Y = int(input("M :")), int(input("Y :")) #ป้อนค่าจำนวนเต็ม เดือนและปี
print(f"เดือนที่ {M} มี {find_day(M, Y)[0]} วัน\nปีที่ {Y} มี {find_day(M, Y)[1]} วัน") # แสดงผลลัพธ์ฟังก์ชั่นด้านบนเมื่อป้อนค่าเข้าไป